Catalogs/ВидыРаботМедицинскихОсмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыРаботМедицинскихОсмотров</Name>
			<Comment>АПК:58 различия имени и синонима оправданы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьОсмотра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьОсмотра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПериодичностиОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериодичностиОсмотра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствиеПодтверждено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Однократно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствующиеВредныеФакторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОбследований</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МедицинскийОсмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПсихиатрическоеОсвидетельствование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыРаботМедицинскихОсмотров/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Код");
	Поля.Добавить("ВидОсмотра");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.ВидОсмотра = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	МедицинскиеОсмотрыКлиентСервер.ЗаполнитьПредставлениеВредногоФактораВидаРабот(Данные, Представление);
	
КонецПроцедуры
	
#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки,
		"МедицинскиеОсмотры");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение(ПараметрыОбновления = Неопределено) Экспорт
	
	Если ПараметрыОбновления = Неопределено Тогда
		ПараметрыОбновления = Новый Структура("ОбработкаЗавершена");
	КонецЕсли;
	
	Если ЕстьЭлементы() Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	СоздатьЭлементыПоМакету("Перечень", Перечисления.ВидыОбследований.МедицинскийОсмотр);
	СоздатьЭлементыПоМакету("ПсихиатрическийПеречень",
		Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование);
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьВидОсмотраМедицинскогоПеречня(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыРаботМедицинскихОсмотров.Ссылка
		|ИЗ
		|	Справочник.ВидыРаботМедицинскихОсмотров КАК ВидыРаботМедицинскихОсмотров
		|ГДЕ
		|	ВидыРаботМедицинскихОсмотров.ВидОсмотра = ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.ПустаяСсылка)";
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	ОписаниеБлокировки = ОбновлениеИБ.ОписаниеБлокируемыхДанных(Метаданные.Справочники.ВидыРаботМедицинскихОсмотров);
	
	МедицинскийОсмотр = Перечисления.ВидыОбследований.МедицинскийОсмотр;
	ВыборкаОбновляемыхДанных = ОбновляемыеДанные.Выбрать();
	Пока ВыборкаОбновляемыхДанных.Следующий() Цикл
		ОписаниеБлокировки.ПоляБлокировки.Ссылка = ВыборкаОбновляемыхДанных.Ссылка;
		Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеБлокировки, ПараметрыОбновления) Тогда
			Возврат;
		КонецЕсли;
		ВидРабот = ВыборкаОбновляемыхДанных.Ссылка.ПолучитьОбъект();
		ВидРабот.ВидОсмотра = МедицинскийОсмотр;
		
		// АПК:1327-выкл используется в процедуре обновления.
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидРабот);
		// АПК:1327-вкл
		
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьЭлементыПсихиатрическогоПеречня(ПараметрыОбновления = Неопределено) Экспорт
	
	ПсихиатрическоеОсвидетельствование = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование;
	
	Если ЕстьЭлементы(ПсихиатрическоеОсвидетельствование) Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);
	
	СоздатьЭлементыПоМакету("ПсихиатрическийПеречень", ПсихиатрическоеОсвидетельствование);	
	
КонецПроцедуры
 
Функция ЕстьЭлементы(ВидОсмотра = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	Справочник.ВидыРаботМедицинскихОсмотров КАК ВидыРаботМедицинскихОсмотров
		|ГДЕ
		|	&УсловиеОтбора";
	
	Если ВидОсмотра = Неопределено Тогда
		ТекстЗамены = "ИСТИНА";
	Иначе
		Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
		ТекстЗамены = "ВидыРаботМедицинскихОсмотров.ВидОсмотра = &ВидОсмотра";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", ТекстЗамены);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура СоздатьЭлементыПоМакету(ИмяМакета, ВидОсмотра)
	
	ТаблицаИзМакета = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ПолучитьМакет(ИмяМакета).ПолучитьТекст()).Данные;
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("Справочник.ВидыРаботМедицинскихОсмотров");
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		СоздатьЭлементыПоТаблицеМакета(ТаблицаИзМакета, ВидОсмотра);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка заполнения классификатора видов работ медицинских осмотров'", 
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

Процедура СоздатьЭлементыПоТаблицеМакета(ТаблицаМакета, ВидОсмотра)
	
	Для Каждого СтрокаТаблицы Из ТаблицаМакета Цикл
		ДобавитьЭлемент(СтрокаТаблицы, ТаблицаМакета.Индекс(СтрокаТаблицы), ВидОсмотра);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЭлемент(СтрокаТаблицы, ИндексСтроки, ВидОсмотра)
	
	СправочникОбъект = Справочники.ВидыРаботМедицинскихОсмотров.СоздатьЭлемент();
	СправочникОбъект.Код = СтрокаТаблицы["Code"];
	СправочникОбъект.Наименование = СтрокаТаблицы["Name"];
	СправочникОбъект.Родитель = РодительПоКодуЭлемента(СтрокаТаблицы["Code"]);
	СправочникОбъект.Описание = СтрокаТаблицы["Description"];
	СправочникОбъект.ВидОсмотра = ВидОсмотра;
	СправочникОбъект.РеквизитДопУпорядочивания = ИндексСтроки;
	Если Не ПустаяСтрока(СтрокаТаблицы["FrequencyPeriod"]) Тогда
		СправочникОбъект.КратностьОсмотра = Число(СтрокаТаблицы["FrequencyMultiplicity"]);
		СправочникОбъект.ПериодичностьОсмотра = Число(СтрокаТаблицы["FrequencyRate"]);
		СправочникОбъект.ЕдиницаПериодичностиОсмотра = Перечисления.Периодичность[СтрокаТаблицы["FrequencyPeriod"]];
	КонецЕсли;
	СправочникОбъект.ЗаполнитьПредставлениеПериодичности();
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
КонецПроцедуры

Функция РодительПоКодуЭлемента(КодЭлемента)
	
	ЧастиКодаЭлемента = СтрРазделить(КодЭлемента, ".");
	Если ЧастиКодаЭлемента.Количество() < 2 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧастиКодаЭлемента.Удалить(ЧастиКодаЭлемента.Количество() - 1);
	
	КодРодителя = СтрСоединить(ЧастиКодаЭлемента, ".");
	
	ГруппаСсылка = Справочники.ВидыРаботМедицинскихОсмотров.НайтиПоКоду(КодРодителя);
	Если ГруппаСсылка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ГруппаСсылка.Пустая() Тогда
		Возврат ГруппаСсылка;
	КонецЕсли;
	
	Возврат РодительПоКодуЭлемента(КодРодителя);
	
КонецФункции

Функция ВыполнитьЗаписьОбъекта(ДанныеОбъекта) Экспорт
	
	СправочникОбъект = ЗарплатаКадры.ДесериализоватьОбъектИзДвоичныхДанных(ДанныеОбъекта);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(СправочникОбъект.Ссылка.Метаданные().ПолноеИмя());
	ЭлементБлокировки.УстановитьЗначение("Ссылка", СправочникОбъект.Ссылка);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		СправочникОбъект.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ошибка записи классификатора видов работ медицинских осмотров'", 
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат ЗарплатаКадры.СериализоватьОбъектВДвоичныеДанные(СправочникОбъект);
	
КонецФункции

#КонецОбласти

#КонецЕсли
